{{"name": "Punch-Out!!", "desc": "One of the biggest names in boxing returns after a 15-year hiatus. Grab a Wii Remote controller in one hand and a Nunchuk controller in the other and step back into the ring with a modern update of the classic Punch-Out!! * Little Mac is back! Everyon's favorite underdog from the 1980s joins the best of the original Punch-Out!! cast in a modern re-imagination of the series. Players will find familiar names like Glass Joe, King Hippo and trainer Doc Louis. These boxers come to life again in cel-shaded 3-D, complete with hilarious fighting animations and back stories that capture all the fun and flair of the original Punch-Out!! games. * The motion-sensitive controls of the Wii console mean that when players throw punches, Little Mac throws punches as well. Additionally, you can control hooks and jabs by combining motion control with control-stick movement. The motion-sensing Wii Remote and Nunchuk controllers turn real-life swings into on-screen punches, so anyone can play. The game can also be played with classic NES-style controls by turning the Wii Remote sideways. Characters: Little Mac, Glass Joe, King Hippo, Doc Louis, Von Kaiser and other unannounced favorites. Special powers/weapons/moves/features: Players can obtain special \"Star Punches,\" which allow Little Mac to take more Health from his rival in a single punch. Control options: * Motion Control (Wii Remote and Nunchuk controllers) Punch-Out!! uses the Wii Remote and Nunchuk controllers to simulate throwing punches. Use the Nunchuk to throw a left punch and the Wii Remote to throw a right punch. * Classic Control (Wii Remote NES style) Fans of the NES version and core gamers will be excited to see Nintendo has also included the option to play Punch-Out!! using the classic layout from the original NES controller. Use the 1 and 2 buttons along with the cross pad to throw hooks and jabs or to dodge.", "rating": "0.9", "releaseDate": "20090518T000000", "developer": "Next Level Games", "publisher": "Nintendo", "genre": "Fighting", "players": "2"},{"name": "Super Mario Galaxy", "desc": "Experience a gravity-defying adventure! Become Mario as he traverses gravity-bending galaxies, traveling in and out of gravitational fields by blasting from planet to planet. Players experience dizzying perspective shifts as they run upside down through wild alien worlds that need to be seen to be believed. Whether you're surfing on a ray across an ocean in the clouds, rolling on a ball through a treacherous garden, or floating in a bubble over a poisonous swamp, there's no limit to the cosmic challenges you'll encounter!\n* Shake it! Controlling Mario is as simple as can be with the Wii Remote and Nunchuk. Move Mario with the Control Stick and shake the Wii Remote to perform a spin move or cue Ring Stars that launch you to and from planetary objects. You can even point at bits of stardust to collect them or latch onto Beam Stars to blaze a magnetic trail through the heavens.\n* Mario can run, tiptoe, jump, triple-jump, backflip, and long-jump, but what he'll do most is spin. By shaking the Wii Remote, players make Mario spin around with fists outstretched, allowing him to pummel enemies and cue Star Rings that launch him from planet to planet.\n* He can also find plenty of power-ups: A Bee Mushroom turns him into Bee Mario, allowing him to fly for short periods of time and cling to honeycombs. A Boo Mushroom turns him into Boo Mario, allowing him to float and turn invisible to pass through mesh gates.\n* He'll constantly collect bits of stardust. These can be fired at enemies using the B Button. A second player can even take on this role, using a second Wii Remote to stall enemies, fire stardust, or even sweep aside projectiles.", "rating": "0.7", "releaseDate": "20071112T000000", "developer": "Nintendo", "publisher": "Nintendo", "genre": "Action", "players": "2"},{"name": "Super Mario Galaxy 2", "desc": "Prepare for liftoff with Mario and Yoshi! In 2007, Super Mario Galaxy took the world of video games by storm. Now this first true Mario sequel in years re-energizes the franchise with new levels and new power-ups. Plus this time Mario gets to team up with his dinosaur buddy Yoshi, who adds new possibilities to the gravity-defying game play. It's everything you love about the first game and more.\n* Mario collects stars as he travels from galaxy to galaxy. Every level is new, but the game retains the charm, sense of wonder and beauty in line with Mario's history. Mario works his way through the various levels, sometimes upside-down, sometimes floating from place to place.\n* On some stages, Mario can find an egg, smash it open and hop onto the back of Yoshi. Yoshi can use his tongue to grab items and shoot them back at enemies, or to snag attach points and swing across chasms.\n* Yoshi has an interesting diet. When he eats a Dash Pepper, he gets so hot and frenzied he can run up steep inclines and vertical walls. When he eats a Blimp Fruit, he inflates like a balloon and floats to new heights.\n* New power-ups include a drill that Mario uses to tunnel through the planet's surface all the way to the other side of a planet. * Skilled players will want to collect new Comet Metals, which will unlock harder levels with even more challenges.", "rating": "0.5", "releaseDate": "20100523T000000", "developer": "Nintendo EAD", "publisher": "Nintendo", "genre": "Action", "players": "2"},}